EDT/УТ/src/Enums/ИнициаторыСостояния/ИнициаторыСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИнициаторыСостояния</name>
  <enumValues>
    <name>Клиент</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ТранспортнаяКомпания</name>
    <comment>2</comment>
  </enumValues>
  <enumValues>
    <name>ИнтернетМагазин</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ЗаборТовара/ЗаборТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаборТовара</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>101</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешнегоЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнтернетМагазинаСпр</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <type>
      <types>CatalogRef.новаТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаборСВозвратом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриемки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемВозвратныхЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытиеЗаказов</name>
    <comment>Реквизит для хранения истории по ЗакрытиямЗаказа</comment>
    <type>
      <types>DocumentRef.ЗакрытиеЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллетПланируемое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозвратаПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АПП</name>
    <attributes>
      <name>НомерАПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Возвраты</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыКЗабору</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/УстановкаСтатусовЗаказов/УстановкаСтатусовЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусовЗаказов</name>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <registerRecords>InformationRegister.СостоянияЗаказов</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклоненияЗаказаВСистеме</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусAxiomus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинальныйСтатус</name>
    <type>
      <types>CatalogRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИМ</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьТекущийСтатус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьФинальныйСтатус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьСтатусИМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WebService</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеСтатусаЗаказа</name>
    <type>
      <types>DocumentRef.ДанныеЗаказаВодителя</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/WebServices/Service1C/Module.bsl
Функция AddAcceptanceReportToIntake(intakeNumber, AcceptanceReports, Auth) Экспорт
    Возврат ДобавитьАППКЗабору(intakeNumber, AcceptanceReports, Auth);
КонецФункции

Функция ДобавитьАППКЗабору(intakeNumber, AcceptanceReports, Auth, Volume = 0)
    ЗаборСсылка = Документы.ЗаборТовара.НайтиПоНомеру(intakeNumber);
    Если ЗначениеЗаполнено(ЗаборСсылка) Тогда
        ДокументОбъект = ЗаборСсылка.ПолучитьОбъект();
        Для каждого Стр Из AcceptanceReports.AcceptanceReport Цикл
            СтрокаАПП = ДокументОбъект.АПП.Добавить();
            СтрокаАПП.НомерАПП = Стр.AcceptanceReportNumber;
            СтрокаАПП.ДатаДобавления = Стр.Date;        
		КонецЦикла;
		ДокументОбъект.ОбъемВозвратныхЗаказов = Volume;
        Попытка
        	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
            Возврат 1;
        Исключение
            Возврат 0;
        КонецПопытки;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции	

Функция AddAcceptanceReportToIntakeWithVolume(intakeNumber, AcceptanceReports, Auth, Volume)
	// Вставить содержимое обработчика.
	Возврат ДобавитьАППКЗабору(intakeNumber, AcceptanceReports, Auth, Volume);
КонецФункции

Функция AddVolumeToIntake(intakeNumber, Auth, Volume)
    ЗаборСсылка = Документы.ЗаборТовара.НайтиПоНомеру(intakeNumber);
    Если ЗначениеЗаполнено(ЗаборСсылка) Тогда
        ДокументОбъект = ЗаборСсылка.ПолучитьОбъект();
		ДокументОбъект.ОбъемЗаказов = Volume;
        Попытка
        	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
            Возврат 1;
        Исключение
            Возврат 0;
        КонецПопытки;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции

Функция SetExtNumberToIntake(intakeNumber, Auth, ExtNumber)
    ЗаборСсылка = Документы.ЗаборТовара.НайтиПоНомеру(intakeNumber);
    Если ЗначениеЗаполнено(ЗаборСсылка) Тогда
        ДокументОбъект = ЗаборСсылка.ПолучитьОбъект();
		ДокументОбъект.ДополнительныйНомер = ExtNumber;
        Попытка
        	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
            Возврат 1;
        Исключение
            Возврат 0;
        КонецПопытки;
    Иначе
        Возврат 0;
    КонецЕсли;
КонецФункции

Функция setCurrentStatus(orderId, statusId, processingTerminal, initiator, reasonId, deliveryDate) 
	
	//Задача № 3231
	Попытка
		
		НомерЗаказа = Строка(orderId);
		НомерЗаказа = СтрЗаменить(НомерЗаказа, Символы.НПП, "");
		
		//КодПричины = Формат(reasonId, "ЧЦ=11; ЧВН=; ЧГ=");
		КодПричины = reasonId;
		
		ДокументЗаказСсылка = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(НомерЗаказа);
		Если  ЗначениеЗаполнено(ДокументЗаказСсылка) Тогда
			
			ДокументУстановкаСтатуса = Документы.УстановкаСтатусовЗаказов.СоздатьДокумент();
			
			ДокументУстановкаСтатуса.Дата = ТекущаяДата();
			ДокументУстановкаСтатуса.Заказ = ДокументЗаказСсылка;
			ДокументУстановкаСтатуса.WebService = Истина;
			ДокументУстановкаСтатуса.ТекущийСтатус = Справочники.СтатусыЗаказов.НайтиПоКоду(statusId);
			ДокументУстановкаСтатуса.УстанавливатьТекущийСтатус =  Ложь;
			
			ДокументУстановкаСтатуса.ТерминалОбработки = Справочники.РегиональныеТерминалы.НайтиПоКоду(processingTerminal);
			ДокументУстановкаСтатуса.ПричинаОтказаПереноса = Справочники.ПричиныОтказаПереноса.НайтиПоКоду(КодПричины);
			
			Если initiator = 1 Тогда
				ДокументУстановкаСтатуса.ИнициаторСостояния = Перечисления.ИнициаторыСостояния.ИнтернетМагазин;
			ИначеЕсли initiator = 2 тогда
				ДокументУстановкаСтатуса.ИнициаторСостояния = Перечисления.ИнициаторыСостояния.Клиент;
			ИначеЕсли initiator = 3 тогда
				ДокументУстановкаСтатуса.ИнициаторСостояния = Перечисления.ИнициаторыСостояния.ТранспортнаяКомпания;
			КонецЕсли;	
			
			// ++Задача № 3469
			Если statusId = 232 тогда
				ДокументУстановкаСтатуса.ДатаПереноса = deliveryDate;
			КонецЕсли;
			// --Задача № 3469
			
			ДокументУстановкаСтатуса.Записать(РежимЗаписиДокумента.Запись);
			
			Попытка
				
				ДокументУстановкаСтатуса.Записать(РежимЗаписиДокумента.Проведение);
				
				Возврат 0;
				
			Исключение
				
				ТекстОшибки = ОписаниеОшибки();
				ТекстОшибкиКЗаписи = "Не удалось установить статус " + Строка(statusId) + 
				" для " + Строка(ДокументУстановкаСтатуса.Заказ) + 
				" (Документ " + СокрЛП(ДокументУстановкаСтатуса.Ссылка) + ")" + 
				Символы.ПС + "Текст ошибки: " + ТекстОшибки;
				
				pkv.ДобавитьВСписокОтложенногоПроведения(ДокументУстановкаСтатуса.Ссылка, ТекстОшибкиКЗаписи);  //Дробница Р. по skype ЕМ 13.09.2019 11:10
				
				Возврат -1;
				
			Конецпопытки;
			
		Иначе
			
			Возврат -1;
			
		Конецесли;
		
	Исключение
		
		Возврат -1;
		
	Конецпопытки;
	
КонецФункции
